IDEA StatiCa Open Model
NonConformitySeverity Enumeration
Compatible with IDEA StatiCa Beta 21.0 - beta
 Nonconformity severities
 Namespace: IdeaRS.OpenModel.Message
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public enum NonConformitySeverity
Public Enumeration NonConformitySeverity
public enum class NonConformitySeverity
Members
Member name | Value | Description
Info | 0 |  Information
Warning | 1 |  Deal as warning
Error | 2 |  Error
TerminatedError | 3 |  Error, coancel of the calculation required
See Also
Reference
IdeaRS.OpenModel.Message Namespace